In [1]:
import pandas as pd

# Load a dataset

In [2]:
df=pd.read_csv(r"C:\Users\Lenovo\OneDrive\Desktop\Data Anayltic\Pandas\1000_employeesz.csv")

In [3]:
df

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
0,1,Pooja Sharma,Manager,Marketing,32,671897,2016-10-14,UK
1,2,Arjun Saini,HR Executive,IT,59,1387572,2020-04-23,USA
2,3,Priya Sharma,HR Executive,Sales,45,511251,2020-02-02,USA
3,4,Vikas Sharma,Accountant,Finance,54,325244,2019-03-23,USA
4,5,Sneha Kumar,Sales Executive,IT,50,403448,2022-05-20,Canada
...,...,...,...,...,...,...,...,...
995,996,Rohan Joshi,Manager,Sales,33,1292140,2020-07-24,Australia
996,997,Anjali Joshi,Accountant,IT,35,606056,2021-04-01,India
997,998,Arjun Mehta,Sales Executive,HR,56,1079105,2018-04-01,Canada
998,999,Neha Sharma,Manager,HR,55,1276940,2025-04-17,UK
999,1000,Sneha Kumar,Software Engineer,HR,23,462474,2016-03-09,Canada

In [4]:
df.head()

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
0,1,Pooja Sharma,Manager,Marketing,32,671897,2016-10-14,UK
1,2,Arjun Saini,HR Executive,IT,59,1387572,2020-04-23,USA
2,3,Priya Sharma,HR Executive,Sales,45,511251,2020-02-02,USA
3,4,Vikas Sharma,Accountant,Finance,54,325244,2019-03-23,USA
4,5,Sneha Kumar,Sales Executive,IT,50,403448,2022-05-20,Canada

# Basic Dataset Information

In [5]:
df.shape

(1000, 8)

In [6]:
df.columns

Index(['EEID', 'Full_Name', 'Job_Title', 'Department', 'Age', 'Annual_Salary',
       'Hire_Date', 'Country'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   int64
 1   Full_Name      1000 non-null   object
 2   Job_Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Age            1000 non-null   int64
 5   Annual_Salary  1000 non-null   int64
 6   Hire_Date      1000 non-null   object
 7   Country        1000 non-null   object
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [8]:
df.tail

<bound method NDFrame.tail of      EEID     Full_Name          Job_Title Department  Age  Annual_Salary  \
0       1  Pooja Sharma            Manager  Marketing   32         671897
1       2   Arjun Saini       HR Executive         IT   59        1387572
2       3  Priya Sharma       HR Executive      Sales   45         511251
3       4  Vikas Sharma         Accountant    Finance   54         325244
4       5   Sneha Kumar    Sales Executive         IT   50         403448
..    ...           ...                ...        ...  ...            ...
995   996   Rohan Joshi            Manager      Sales   33        1292140
996   997  Anjali Joshi         Accountant         IT   35         606056
997   998   Arjun Mehta    Sales Executive         HR   56        1079105
998   999   Neha Sharma            Manager         HR   55        1276940
999  1000   Sneha Kumar  Software Engineer         HR   23         462474

      Hire_Date    Country
0    2016-10-14         UK
1    2020-04-23        USA
2    2020-02-02        USA
3    2019-03-23        USA
4    2022-05-20     Canada
..          ...        ...
995  2020-07-24  Australia
996  2021-04-01      India
997  2018-04-01     Canada
998  2025-04-17         UK
999  2016-03-09     Canada

[1000 rows x 8 columns]>

In [9]:
df['Annual_Salary'].unique()

array([ 671897, 1387572,  511251,  325244,  403448, 1071294,  543246,
        738777,  335912, 1461638, 1130523, 1040531, 1270655,  604610,
        701706,  718917,  630274,  420500, 1441546,  864601, 1094312,
       1366406, 1476598,  678804,  308331, 1345099,  566012, 1293463,
        592072,  546503,  505337, 1250834,  430071,  528282,  619449,
       1228252, 1044474, 1013262,  384214,  366663, 1233691, 1246819,
        865356,  426936,  734991,  907626,  439298,  897903,  878013,
        414923, 1321779,  742150,  786895,  692487, 1255171, 1477001,
        799976,  914805, 1463100,  956625,  302782,  629244,  584540,
       1109613, 1339701, 1133293,  437789,  563655, 1385430, 1494772,
       1168718, 1184356, 1299185, 1335572, 1051521, 1048916, 1089695,
       1487219,  577195,  318773,  455076,  677486,  489242,  747925,
       1098732,  908559,  983204,  955122,  447021, 1345799,  301148,
       1316950,  408019,  655621,  380041,  376662, 1270481, 1055020,
       1292130, 1274949,  840146,  469074, 1451222,  715610,  370131,
        618033,  611274, 1266525, 1064094, 1146574,  913009,  400688,
       1017976,  304168, 1326062, 1116773, 1021090, 1098890, 1005486,
        884962,  444130, 1186919,  919286,  539637, 1293552, 1092276,
       1450639, 1368516, 1103006, 1222553,  738550,  792435,  536821,
        598390,  926142,  978965, 1104586, 1096602, 1207606,  450648,
        399479,  969752,  717740,  644093,  720063,  313555, 1165881,
        722989, 1489567, 1175408, 1301682, 1140267, 1004231,  539901,
        850094, 1221199, 1125623,  729812,  499529,  825928,  782629,
        348427, 1032710, 1267507,  351483, 1358390, 1038028, 1244976,
       1419577,  626805, 1398624,  410699,  929863, 1406744,  502414,
        976215, 1061212, 1287655, 1492942,  752827,  972473, 1485566,
       1164285,  562306, 1341759,  479316,  839531, 1409533,  778147,
       1074735, 1235504, 1270051,  996001,  676774,  775670, 1320615,
       1491729,  598206,  560487,  971898,  561620, 1241362,  300112,
        975292, 1096410,  835989,  490655,  472078, 1218227, 1279599,
        422143,  570827,  677906,  716996,  449446,  587557, 1245414,
        497583,  357965,  894742, 1426751,  455342,  666079,  809558,
        498262,  379467,  608052, 1020425,  840414,  867697,  868845,
       1295989, 1067149,  862834,  696349, 1202297,  389128, 1497323,
       1261662, 1425039,  491901, 1417843,  685509, 1494788, 1119320,
        981210, 1065659, 1278472, 1357566,  737255, 1199810,  813872,
        627934, 1221840,  366624, 1293053, 1101988,  494732,  657165,
        450108,  729315,  390507, 1228469,  706510, 1236756,  359366,
        474280,  664428,  533476,  997783, 1066721,  805885, 1451807,
        398717, 1282564, 1057225,  396918,  616762, 1189761,  997108,
        413614, 1068710, 1263967,  405383, 1237328, 1373680,  847956,
        782793,  921624,  575875,  520522,  945045,  421997,  893915,
        759445, 1323314, 1088984,  848552, 1345290, 1257442,  921804,
        791751, 1073630, 1231463, 1295943,  799374, 1447396, 1012432,
       1324300,  373262,  479266,  790980,  477305, 1250837,  838398,
        695751, 1055471, 1268884,  833536,  994452, 1391981,  865935,
       1325284, 1057285, 1228785,  574963, 1277936,  700998, 1222956,
        456855, 1232607, 1339836,  564541,  429691,  384154,  545253,
        764885,  358678,  993510,  828011, 1184984,  317756,  481626,
       1076716,  806655,  739483,  771978,  465508,  451175, 1414067,
        891356,  513385, 1303085,  725888,  700196,  398004,  758288,
       1299123,  463103,  379630,  632401,  929645,  441427,  435937,
       1115730, 1000323, 1002911, 1105548,  650101,  523648,  815150,
       1198638, 1399563, 1442137,  772213, 1384369,  517514, 1170498,
       1261789,  910335, 1296281,  415054,  757306,  966147,  849839,
        716249,  391349,  920933, 1218294,  836931,  573049,  567343,
       1055484,  602773, 1132881,  856938, 1177993, 1194873, 1420260,
        980906,  987934,  672655, 1456915,  891843, 1400697,  751180,
        473267,  691053,  358372,  421125,  348488, 1258039,  349481,
       1197429, 1170186,  773306,  463445, 1247321,  623655,  338871,
        797236,  495880, 1445883,  536986, 1314195, 1194104, 1038909,
        605679, 1124472,  455378, 1492610, 1460671,  770850,  308522,
        607958, 1498893, 1184485, 1120879, 1257853, 1495985,  444402,
        361402, 1312878,  547080,  865536,  705842, 1151404,  449708,
        567689, 1413960, 1035484, 1423506,  944013, 1100545,  484067,
       1169314, 1143256,  323663, 1474022, 1450788,  725038, 1447453,
        349390,  513274,  427070,  784869,  943533, 1498818, 1245580,
        723714,  878864, 1452634, 1036429, 1217904, 1495564,  564663,
        726236,  530466,  468534,  427573,  479999, 1199175,  586085,
        521519,  712213,  824967,  662236,  635066,  608511,  901501,
        611536, 1409517, 1494520, 1212216,  303520, 1132508,  796378,
        306344, 1026936, 1379066,  427089, 1302655, 1237067, 1304828,
        912431,  414673,  326003,  876184, 1204983,  879646, 1308559,
        726165,  366017,  771642,  946523,  320948,  563634,  998504,
        590143,  668931,  307231, 1157742,  631565, 1328492,  993023,
       1312413, 1235009,  694025, 1179570, 1317891,  471543,  613013,
        541587,  627304,  959142, 1203226,  321148,  429721,  584525,
        910440,  676506,  530375,  379056,  510976,  998007,  905728,
       1470673,  508254,  424517,  604753,  422918,  461229,  988700,
       1196910, 1284932, 1078641,  687625, 1379409,  571878,  498772,
        427714,  431891, 1265944,  677738,  864069,  929956, 1349730,
        606253,  905009,  449018,  659449,  597022, 1097231, 1451818,
        461135,  371354, 1011022, 1173187, 1437979,  589748,  532250,
       1125753,  921655, 1320328, 1184772, 1335436,  552256, 1246811,
       1066018, 1097351,  303773,  847565,  343613,  646882, 1260437,
        608129,  762343,  347029, 1170990,  973871,  338769,  639878,
        328102,  425675,  326957, 1041899, 1044468,  325644,  399986,
       1358106, 1477062, 1226187,  941349,  492765,  526990,  677860,
        459746,  673296,  948772, 1092621, 1391144,  315316,  387544,
        897044,  739508,  660705, 1013430,  494371,  834606,  466131,
        771315,  750745,  526613, 1151938, 1200843,  580651, 1249133,
        830791, 1001201,  385812,  856970,  320485,  329198,  477112,
        947085,  740380,  589264,  580156, 1371573, 1133210,  897548,
       1050635,  953833, 1256129,  752293, 1304504,  943412,  442767,
       1297211,  667730,  433654, 1491095,  723718, 1058702, 1126574,
       1360391,  991425,  630653,  456408, 1243269,  881324,  782028,
       1120422,  586437,  548924,  953062,  939713, 1147969,  909328,
        499618,  767722,  815577,  813591,  979267,  409837,  393093,
       1470679, 1232150, 1156392, 1289139,  514705,  519147,  894430,
       1059088, 1041069,  455827,  863689, 1208633, 1356507, 1149881,
        832301, 1038416, 1440255, 1123592, 1032156,  797597, 1291484,
        846372, 1263904, 1242888,  953996,  646261,  882271,  980019,
       1024860, 1414940, 1162953, 1056187,  953532,  998616, 1102265,
       1406077,  640748, 1129295,  425144, 1140500, 1217796,  566803,
       1497867, 1476844, 1294655,  617987, 1394684, 1415374, 1379314,
       1297003, 1134984,  346390, 1463044, 1344371, 1241012,  300549,
        860098,  848187,  402500,  346706, 1457784,  483603, 1038700,
        861495,  967881, 1011797, 1332341, 1458022,  999165,  809351,
       1435214,  307736, 1473585,  639303, 1213581, 1157366,  790270,
       1396128, 1113008,  942923, 1477957,  641378,  847804, 1265195,
        530563,  304354, 1252052,  478032,  945668, 1124836,  472808,
       1046231,  337790, 1360546,  589089, 1100181, 1104944, 1367333,
        333946,  732920,  823812, 1091525,  815460,  704672,  812236,
       1188446,  433066,  393357, 1079978, 1217727, 1496430,  318883,
        512037,  845149,  464626, 1378681,  585245,  623144,  862102,
        313325, 1051552, 1142406, 1146098, 1302577,  410227,  670735,
        363486, 1414433,  693797, 1417006,  553157, 1276840, 1474526,
        635606, 1309949,  622861, 1006370, 1442915,  942810, 1376733,
       1074899,  689610, 1044959,  593774,  964215,  691496, 1279884,
        888570,  962937,  497990, 1127451,  352531,  914034,  556707,
        333869,  761747, 1224251, 1015945, 1387557,  452022,  307741,
        905323, 1013891, 1149742, 1367269, 1029258, 1404278, 1279993,
        314970, 1171158,  515951, 1089804, 1165023,  615653,  439444,
        793270,  500562, 1426652,  678600,  861098,  877640,  476156,
        502797, 1192443,  609390,  656754,  412727,  928247,  631021,
       1225094,  736551,  452274,  405487, 1494167, 1297695,  889383,
        487686, 1352029,  669354,  885762,  755467,  426617,  665332,
       1262282,  494865,  438578,  558010,  502638, 1021304, 1140533,
        481746,  849095,  741672,  978378,  523445, 1032578, 1338121,
        839220, 1005105,  899975,  553698,  697278,  652305, 1043892,
       1310439, 1414470,  878189,  915945,  409702,  580919,  984327,
       1012423,  635381,  825816,  630479,  360919,  814993,  362876,
        312424, 1185100, 1091888, 1071620,  316965, 1141934, 1023273,
       1083446,  982624,  541255,  309498,  571010,  695093,  626274,
       1084532,  395069,  603081,  457231,  995345,  982983, 1457878,
       1305628,  515521, 1434703,  498218, 1042983, 1366898,  674191,
        366932,  492710, 1334452,  894059,  604425,  568276,  699819,
        957927,  371905, 1488388, 1149029,  933448, 1065029,  413488,
       1315214,  816678, 1250198,  464593,  511994,  938963, 1045195,
       1300205, 1180977,  677466,  725686, 1003781,  517219, 1162102,
       1482038, 1435345, 1001631,  647705,  435744,  321067,  676483,
       1086460, 1255627,  673884,  860326,  432844, 1062191, 1168046,
       1258150, 1292140,  606056, 1079105, 1276940,  462474])

In [10]:
df['Country'].nunique()

5

In [11]:
df.describe()

              EEID          Age  Annual_Salary
count  1000.000000  1000.000000   1.000000e+03
mean    500.500000    40.026000   8.808740e+05
std     288.819436    11.703431   3.494568e+05
min       1.000000    21.000000   3.001120e+05
25%     250.750000    30.000000   5.672080e+05
50%     500.500000    39.000000   8.853620e+05
75%     750.250000    51.000000   1.184825e+06
max    1000.000000    60.000000   1.498893e+06

# Data Cleaning

In [12]:
# Check missing values
df.isnull().sum()

EEID             0
Full_Name        0
Job_Title        0
Department       0
Age              0
Annual_Salary    0
Hire_Date        0
Country          0
dtype: int64

In [13]:
# Fill the missing age with median
df1=df['Age'].fillna(df['Age'].median())

In [14]:
df1

0      32
1      59
2      45
3      54
4      50
       ..
995    33
996    35
997    56
998    55
999    23
Name: Age, Length: 1000, dtype: int64

In [15]:
df.duplicated().sum()

np.int64(0)

In [16]:
df2=df.drop_duplicates()

In [17]:
df2

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
0,1,Pooja Sharma,Manager,Marketing,32,671897,2016-10-14,UK
1,2,Arjun Saini,HR Executive,IT,59,1387572,2020-04-23,USA
2,3,Priya Sharma,HR Executive,Sales,45,511251,2020-02-02,USA
3,4,Vikas Sharma,Accountant,Finance,54,325244,2019-03-23,USA
4,5,Sneha Kumar,Sales Executive,IT,50,403448,2022-05-20,Canada
...,...,...,...,...,...,...,...,...
995,996,Rohan Joshi,Manager,Sales,33,1292140,2020-07-24,Australia
996,997,Anjali Joshi,Accountant,IT,35,606056,2021-04-01,India
997,998,Arjun Mehta,Sales Executive,HR,56,1079105,2018-04-01,Canada
998,999,Neha Sharma,Manager,HR,55,1276940,2025-04-17,UK
999,1000,Sneha Kumar,Software Engineer,HR,23,462474,2016-03-09,Canada

# Data Filtering

In [18]:
df[df['Age']>40]

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
1,2,Arjun Saini,HR Executive,IT,59,1387572,2020-04-23,USA
2,3,Priya Sharma,HR Executive,Sales,45,511251,2020-02-02,USA
3,4,Vikas Sharma,Accountant,Finance,54,325244,2019-03-23,USA
4,5,Sneha Kumar,Sales Executive,IT,50,403448,2022-05-20,Canada
6,7,Sneha Patel,Manager,Sales,47,543246,2016-06-26,UK
...,...,...,...,...,...,...,...,...
992,993,Sneha Sharma,Data Analyst,Finance,51,1062191,2020-07-19,USA
993,994,Sneha Singh,Manager,Finance,45,1168046,2023-05-25,Australia
994,995,Arjun Gupta,HR Executive,IT,55,1258150,2024-09-30,UK
997,998,Arjun Mehta,Sales Executive,HR,56,1079105,2018-04-01,Canada
998,999,Neha Sharma,Manager,HR,55,1276940,2025-04-17,UK

In [19]:
df[df['Country']== 'India']

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
13,14,Anjali Yadav,Software Engineer,IT,60,604610,2023-04-30,India
16,17,Rahul Singh,Software Engineer,Finance,21,630274,2023-06-30,India
24,25,Pooja Sharma,Sales Executive,Sales,41,308331,2022-07-30,India
29,30,Priya Saini,Data Analyst,Marketing,32,546503,2021-09-11,India
31,32,Vikas Saini,HR Executive,Finance,49,1250834,2016-08-13,India
...,...,...,...,...,...,...,...,...
974,975,Neha Verma,Accountant,HR,47,1180977,2020-10-28,India
975,976,Arjun Saini,Software Engineer,HR,36,677466,2025-12-17,India
977,978,Amit Sharma,Accountant,HR,34,1003781,2019-05-09,India
989,990,Anjali Mehta,Data Analyst,IT,50,673884,2022-03-29,India
996,997,Anjali Joshi,Accountant,IT,35,606056,2021-04-01,India

In [20]:
df[df['Department']== 'IT']

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
1,2,Arjun Saini,HR Executive,IT,59,1387572,2020-04-23,USA
4,5,Sneha Kumar,Sales Executive,IT,50,403448,2022-05-20,Canada
8,9,Sneha Joshi,Sales Executive,IT,57,335912,2020-12-30,Canada
12,13,Neha Mehta,Software Engineer,IT,43,1270655,2017-03-19,UK
13,14,Anjali Yadav,Software Engineer,IT,60,604610,2023-04-30,India
...,...,...,...,...,...,...,...,...
989,990,Anjali Mehta,Data Analyst,IT,50,673884,2022-03-29,India
990,991,Anjali Mehta,Data Analyst,IT,59,860326,2020-01-10,USA
991,992,Pooja Patel,Manager,IT,46,432844,2019-04-25,Canada
994,995,Arjun Gupta,HR Executive,IT,55,1258150,2024-09-30,UK
996,997,Anjali Joshi,Accountant,IT,35,606056,2021-04-01,India

In [21]:
df[(df['Age'] > 25) & (df['Department'] == 'IT')]

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
1,2,Arjun Saini,HR Executive,IT,59,1387572,2020-04-23,USA
4,5,Sneha Kumar,Sales Executive,IT,50,403448,2022-05-20,Canada
8,9,Sneha Joshi,Sales Executive,IT,57,335912,2020-12-30,Canada
12,13,Neha Mehta,Software Engineer,IT,43,1270655,2017-03-19,UK
13,14,Anjali Yadav,Software Engineer,IT,60,604610,2023-04-30,India
...,...,...,...,...,...,...,...,...
989,990,Anjali Mehta,Data Analyst,IT,50,673884,2022-03-29,India
990,991,Anjali Mehta,Data Analyst,IT,59,860326,2020-01-10,USA
991,992,Pooja Patel,Manager,IT,46,432844,2019-04-25,Canada
994,995,Arjun Gupta,HR Executive,IT,55,1258150,2024-09-30,UK
996,997,Anjali Joshi,Accountant,IT,35,606056,2021-04-01,India

# Data Sorting

In [22]:
df.sort_values(by='Annual_Salary',ascending=False)

,EEID,Full_Name,Job_Title,Department,Age,Annual_Salary,Hire_Date,Country
435,436,Vikas Mehta,Accountant,HR,57,1498893,2016-04-09,Canada
467,468,Rohan Verma,Software Engineer,Sales,59,1498818,2022-05-14,UK
728,729,Rahul Gupta,Sales Executive,Sales,31,1497867,2016-06-05,India
237,238,Rahul Verma,Software Engineer,Sales,38,1497323,2025-01-26,Canada
796,797,Anjali Sharma,Software Engineer,Marketing,32,1496430,2023-11-02,Canada
...,...,...,...,...,...,...,...,...
494,495,Pooja Patel,Data Analyst,Finance,38,303520,2022-11-11,Australia
60,61,Anjali Gupta,Sales Executive,Marketing,27,302782,2021-05-26,UK
90,91,Rohan Gupta,Accountant,Marketing,36,301148,2021-10-06,USA
741,742,Pooja Verma,Accountant,Sales,41,300549,2016-10-23,Australia
202,203,Vikas Kumar,Accountant,Marketing,30,300112,2017-04-04,India

In [23]:
df['Country'].value_counts()

Country
Canada       227
UK           212
India        193
Australia    187
USA          181
Name: count, dtype: int64

In [24]:
df.groupby('Department')['Annual_Salary'].max()

Department
Finance      1495564
HR           1498893
IT           1495985
Marketing    1496430
Sales        1498818
Name: Annual_Salary, dtype: int64